#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: renovate[bot], Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
null_resource.ssh-key: Refreshing state... [id=2302757483213027103]
random_password.cluster_pass: Refreshing state... [id=none]
data.local_file.ssh-key: Reading...
data.local_file.ssh-key: Read complete after 0s [id=8edc68c81d9799ba433d767bbc2db56878ad5970]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_dns.k8s_dns: Refreshing state... [id=113800519373]
sakuracloud_disk.k8s_rook_disk[4]: Refreshing state... [id=113800519392]
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113800519378]
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113800519377]
sakuracloud_disk.k8s_rook_disk[3]: Refreshing state... [id=113800519376]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113800519375]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113800519384]
sakuracloud_disk.k8s_rook_disk[5]: Refreshing state... [id=113800519371]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113800519372]
data.sakuracloud_archive.ubuntu_archive: Read complete after 1s [id=113601947141]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113800519388]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113800519389]
sakuracloud_disk.k8s_worker_node_disk[4]: Refreshing state... [id=113800519385]
sakuracloud_disk.k8s_worker_node_disk[3]: Refreshing state... [id=113800519381]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113800519390]
sakuracloud_disk.k8s_worker_node_disk[5]: Refreshing state... [id=113800519386]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113800519379]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113800519382]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113800519374]
sakuracloud_dns_record.root_record_ipv4: Refreshing state... [id=dnsrecord-4196036112]
sakuracloud_vpc_router.k8s_internal_router: Refreshing state... [id=113800519393]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113800519419]
sakuracloud_server.k8s_worker_node[5]: Refreshing state... [id=113800519418]
sakuracloud_server.k8s_worker_node[3]: Refreshing state... [id=113800519417]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113800519422]
sakuracloud_server.k8s_worker_node[4]: Refreshing state... [id=113800519420]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113800519421]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113800519403]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113800519401]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # sakuracloud_dns.k8s_dns has been deleted
  - resource "sakuracloud_dns" "k8s_dns" {
      - dns_servers = [
          - "ns1.gslb4.sakura.ne.jp",
          - "ns2.gslb4.sakura.ne.jp",
        ] -> null
      - id          = "113800519373" -> null
        tags        = []
      - zone        = "drove-dev.ictsc.net" -> null
        # (2 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # sakuracloud_dns.k8s_dns will be created
  + resource "sakuracloud_dns" "k8s_dns" {
      + dns_servers = (known after apply)
      + id          = (known after apply)
      + zone        = "drove-dev.ictsc.net"

      + record (known after apply)
    }

  # sakuracloud_dns_record.root_record_ipv4 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv4" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "A"
      + value  = "163.43.146.136"
    }

  # sakuracloud_dns_record.root_record_ipv6 will be created
  + resource "sakuracloud_dns_record" "root_record_ipv6" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 300
      + type   = "AAAA"
      + value  = "2001:e42:407:1041::2:0"
    }

  # sakuracloud_dns_record.wildcard_record will be created
  + resource "sakuracloud_dns_record" "wildcard_record" {
      + dns_id = (known after apply)
      + id     = (known after apply)
      + name   = "*"
      + ttl    = 300
      + type   = "CNAME"
      + value  = "drove-dev.ictsc.net."
    }

  # sakuracloud_server.k8s_control_plane[0] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519374",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-1"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.146.129"
          + hostname        = "drove-dev-control-plane-1"
          + ip_address      = "163.43.146.132"
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519380"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.1"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[1] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519379",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.146.129"
          + hostname        = "drove-dev-control-plane-2"
          + ip_address      = "163.43.146.133"
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519380"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.2"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_control_plane[2] will be created
  + resource "sakuracloud_server" "k8s_control_plane" {
      + commitment        = "standard"
      + core              = 2
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519382",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-control-plane-3"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "163.43.146.129"
          + hostname        = "drove-dev-control-plane-3"
          + ip_address      = "163.43.146.134"
          + netmask         = 28
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519380"
          + user_ip_address = (known after apply)
        }
      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.3"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[1] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519390",
          + "113800519375",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-2"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-2"
          + ip_address      = "192.168.100.102"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.102"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[3] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519381",
          + "113800519376",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-4"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-4"
          + ip_address      = "192.168.100.104"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.104"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_server.k8s_worker_node[5] will be created
  + resource "sakuracloud_server" "k8s_worker_node" {
      + commitment        = "standard"
      + core              = 4
      + cpu_model         = (known after apply)
      + disks             = [
          + "113800519386",
          + "113800519371",
        ]
      + dns_servers       = (known after apply)
      + gateway           = (known after apply)
      + gpu_model         = (known after apply)
      + hostname          = (known after apply)
      + id                = (known after apply)
      + interface_driver  = "virtio"
      + ip_address        = (known after apply)
      + memory            = 8
      + name              = "drove-dev-worker-node-6"
      + netmask           = (known after apply)
      + network_address   = (known after apply)
      + private_host_name = (known after apply)
      + tags              = [
          + "dev",
          + "drove",
        ]
      + zone              = (known after apply)

      + disk_edit_parameter {
          + disable_pw_auth = true
          + gateway         = "192.168.100.254"
          + hostname        = "drove-dev-worker-node-6"
          + ip_address      = "192.168.100.106"
          + netmask         = 24
          + password        = (sensitive value)
          + ssh_keys        = [
              + <<-EOT
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIGpC56v8E6bvT47vFlZJlo0+nKy86dTDD0U8hYz0lnCU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJZJEQmv/j0n/jqCICZvg/V0Wizr0kNgdFRNZrCIVZoU
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF6Cl/xWxuJOPax3359DN66XRE/oB0xd4FeCJYV7cAc0
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHB4Rx+5aB0Cdyrmj2UT3uALS/24jPxQUHPBuj6NhVP3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIB6V1IkqvvuvvA+CcdnO5BVWU0ZVuE9Q/u/sJGGB6Dbl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDrIxLLHoBkakduu7KNsKnxF/imogdSTWlrdNZ3dHbrg
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCh5/ur8IgrICNcsdXjjiWeiVsjUet+NaqtB1OdqpVX+vSn2Q4GhQGglxA5oylCaMygcdyY2cQ2S4CEAnWPLu0eTDj3DEvZ09Lko0m079witpCLZFDRJgZ2AfkEwyVUcNCTWVg01S/luiM6ycFQ5ilKZDcuv217Loj24aNlcJPLX9CK+XpJKWNmWbcGrYzvEFWulfbNRoShXKLp94KQzbuhJmYDNhoiIr5yoX6+AMdqHuBNqS2gsWUxJRuzwwyr3rcQWczzG4gmuYA/hYqF0Ut85GJdQVXhBgfJXS7wV1HvqujAlmBirDZEJsLqoA2z9o8+If7EEfQnIsBRxiae+717d/gIomAW19PjsWnd+xJFe8NxMkzFzRlZOAMFgy4kgSVY7t4EvPoOLw5iMg5rLLLAEHvCv6FXp7VXiJakaPTuHt0kVZYfBqBbQAf3KWqF2g00lhm39qvQBOdSn20+qUO/PMEFx5Zyp+SnFWenkQK+ntEU7ZkwbJGA0Han3wR/ZA0=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQVSC5Qd45dyLvhNd1dl34X9hDiq7xLsOHC3b6y8OvM
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHISXZycW8Hyb6sHdkaDkd/9A0QNpsBWP/oAgDaHql0T
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIMSbPj2+InfwmcjjZjP4zSOcfNXbGyLzD8zADJ2C7+VW
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQDM2JpIOAvSr6Jf2lkq0adBixGE3NuWt3TGlcdKhr5rpPr6EoPvmfu4e/jBdhVhzW/M+o4/7MRmO8lXAZ4T6CeI+23c+RF1AE4VY85pyduQQhnYadpdFSaXzc1In7l+TyzYlmDDU7XlH3gxccuJlV7rzwioMXsDUKXdYTrJoeBOl26e3ab1YlNJBqqWCOVtugMmWw+TOu87HPBZy55VNA3RRmrIMtTZnusVVD4Ch9qSSmgTRn7tzsE2Lsq+bkx2nn7tpnT8NDFsdkV9YO7ea/CVK9w/l/4gr4Vc/9yLWmqzjL8b45ENgPZzLJHPEJglyoB9NYQZ9ULzg7xK2nttLh53
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCzUAHYzH67u02L07t42KW4hdupCjylYQJDnwE120TszG4aY7ft4ypTOrdme3QYE/b1g1pn2rMVeLyngBcd8FN0Mi9/RDp7zn1s9HqzunraqQH/XMPE3zgGgGCRdcFmEWaVzq58zhxJmbAjKIKQ2d17SlxVfacdMFvo/0zltHRldlsTXfpKoBaf6EYNWIcG4LyvJsA3/TJNHA2qgRSqEUEPj2btA/MTld/mmrweQlaTMgk/C29AXAVK8KmYEzQsjRlPf/J7GbIV8dq4UW08fq00rKUCgjoEB8RBL5ejXEQ4uVpJuE88hO2+sdRAWk4kTCmKZs3O1vg9HucnRJg1mYKvl3iNH8ye8Mmy0hMwn3Xyo2CRUI0frJNi+PmDapgMhtF1Rqjn72UlzpS6/4pvFVDW9DBu/e7EC1bTuCgSxhcdj9N92AmdUKXTgLosWkf2sBKS7pw9ZOGpRBBp/4ULCXqJkdl9XvXWpJ98+U3Mpm2Y2I2vVooZBmOahtLxuKPdFl8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINxGkLyA/maRQBJ8JEEG9SqvC+7umTLKKuqtXFGaeQsl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOL04DjKo4GEYhwS95YBT0P1AMmvHTf2eOiiK2pmlHui
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAID18NTcud9STFP/MYEpt9XmJ5Vq9JnX96cfcDUglttHQ
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFhgx44sL9Pt/tdqzMZa59kLfOUcK/avuU40lfmPx6wv
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBE0H+iRJ4F6zjyH9UjnidZh2Zv4O953u//6v6u/Prr9+6/27WprZfM6KEG6BGWH+QSmn+wRz//3gYwyJf4bXn4s=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBAX3Jxe5bJ4OC847MZqKF5iFc67o2WLa7AykQA+HClK/F0AtqvUQFySQX60i9VAQRPqNeGXcmi+Q71eaFwG1nSM=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCvNAODW86NBv9tQcnK2KP7ZioPeqU5QxdymsW8lU/jncbK8nVQ1VLZ0f2fp0YMEKYP/l4EWcaXME+ghJWIwCdlXo5Cdy5xuxzu5MrAA1lcEKEfjH+AYKKX7JJB55Pz6XKZL0dKWad8EZ1D9NuNcXsgZitq9jTKxVkr51yInvBaTddFd8K9BIXTgGYdetG/NZaQK8rQNM26P0HxdI9bXCxK2a5uow5YE8KhMwCPhUjniqiFjCAO0GPjmmIAVmZKejI1cJyMJ2Oj8D5ejaU1tOuJYcTG7XZlx/q/BOp+yxpVcGNTTAXZ85rlhpdYTHhmVHfFQmcxp/PwLQ3bpkm0OfLKmI7ymp/4Bl4XC88sfsvL/AXCCYL+YBK8mwFQrMVComTNSExFPa+NWyxndh8sKR8naEEpqaXx3ZgsAOVp4QLUXHAE2VXLfPqllJ6eGPkdZnm2mjTVd5QnzEu4xEM3nz7h/4hXl8pMG5r3I0OjT77GOM+zLpmzgrdD+qWv1NeSLrs=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQD3MRtE9TIFo5URzL3mojm2r5Lc19Hd5MlAuOOgB5qZe4C0H9zO5C1h9YRUAOzOYaSF2bLs/rZniNFEmh4R+pmEdUv2hkikHe5C55GlJRnNECs9NTe5bRwIKHAWC7OkZo8iGG3NcI6HHFLTZKWiAgea35Z/QhRcvxK9kNUONeTL5gGJ0p0TJfIN+YPvtweLL+tDB0ccmwJsP+mJx1XVFCkoA1KcvFcB/9FaUtIYcRWeuz2112KJG7VK4zji4sbsSoD6CCS/B0Ev5UFtRHX3aiG7o4XwtgI1misudU1pFoLkY1+cpxnq408BzZSjlFQPx8GjV+7icuAhQNpY4+El6v0p
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKTTqlJ7aXmGXaIy7xTu9/Hww4gRE7dWn5qM1KKlq74N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIE4rkP0PDsB94NwZfbKi5dT/aQ2+ljo/GOHmU1nm/xA
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDBM3xz9jllqWAK1YNy8qQNBUgjaWsTaqxDA9q67daPPPiXGqsO/B7zmehrNtY83DFeU92Q1+CCp1vuI/Y4xDivcc3RTYdKKycBaAs2+rKkz8fL9Eg9HjOzdZCg/cnlVPOxwh4VdMtWdIbXLuqm8S5bjMrJMKMca0upcJp+s4XHTJ61V7QX2NSNoynPvBeYHyO9QGDEpQi9lcwJh4HrPQUMbUdnK+NiDgkI+kp5zuK75+S6l5kMHioPCeVsqoA8fD+O+v0vjVM2yh5GVPucgWjBaea+EI3RrQsOsocTVkFIoGSTj+ZlMEqaB3qQ840l+ivm2hr6N/FGAbTfkS06PlNH8v7pLi9PU4XHZlqkOfgb0ntCYEx1ZeHpnx58rJHvpauCpL9KM+PetsQjR1WWkaCKl9BQ4ZiEv2zH1zrDjwJw/Wfg9ujjZU/6MaC9OHu2LC/b7mZzRg/i2lliidkEyfy0Ssv5AxzGq6X+W9gq6i8ExOjBqFQlwUmDZykptO7TK4c=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEqJ0KKtWlL1S+X80O4V2tUochPfJxNbxCoTqhLA+R0H
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEpZiH4NyDYMYnndn4IIDAN8sH6Z/n/bxKVEdFJ+MV6E
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAILNirg7s4tvn0ViYZ3PNowi62W4ONT91HdBm8mlKKuC+
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC9KvVLoFZ45DZ1C974XLhgPvFmsncc51EBVydGITne41nuFX762w/VpkVY+Kwu6d4qYB1OkKqo9Y+a9taQCS0d3Po1rkH6a1wMLkfOiBg+fJ5HTX5AWaDZhkrpfCIwrzjF4TGeoOrnE6JnNhy3wDhy/IELSOP+h6IUq74JxzSX696q6neOIlTyu2+2GKTJfexAZDddOwN1o2cMXZYwY1wBEHyHm5yM3FEznPHs99khIl88mgxsn1GP9A4IrnHYcc5Ru2VR7+sxZu2Jdh/EO2uY7DfFOd7B+853xZMlJmaMDf6AWk6h0mk3nvWMfa0fbjQAYQ2PLojFkYWeEH+nAfGdsc2S+gP9EJnXioQ3jtXu6Z4Xh9hMlhmRb2lYNBEDM0TMTY0wnBjvJj2bnpUgWFzCxh8Ab3/xblN0WjL9W/pi3JIVtSvUys/NyQLyWbXCaGUTiNFJHiSWP+ksTKX6o9oaHdUAPFXA0euC/5KuqDufl+xQQpITjqdUOE1z2gkwhep8lMgi1q9pK2U0cf6FFGZUOPOP+6NO8hL9tRAvKvpcjSlN7+pmg/g8/dk4vJrkz58DkT9ig/lofIBy62op+V5Q8SfNUyjm9JzFZ439kZ2/yob906qWims/H7pOo4Osiehx/ezH7BfQloLuov5ittyyUJubr//pFCbaGygUF1pOLQ==
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQD9YPK9cDkqc3c+dUNLgfr7BY551Q+Hp6SHtFT64n0ulpyhcmuDM9hnablO5jpHUyXOYw7BURhjUatkUBcdu2J7xauMgw4mIgbuolFgug+ZWoGyQJYICRT4Ms1VOY/a36aaW4IgRiqLrDelVG27u9RQjD3SFk5WeMdb0+6nT8LXHyn91XiiYQH5JrK2DvkC6BTvGf3Lt1vX0sv0CjmhEiTUMiNGEkymoKLlwtshxw8BBqsTFdwa6re6pbpnwS4TS7mj+WW27amSpaki1wR9uUJe0s2e5iQ6RpHhgnFTb2pxBz+i2uu7oAu+nlFrpkmgXc432+Uz2QuLg1DIXuxMxNDkTZzP/3FRFyEE/6eF5CMtlhDYVNrC6KGzXAFRASeRJT8ZfU6MSWmQ8ku6vf1icm4YqY0OlZQ2e3AZfOsZAKHxMzYr2mFKOSZSYDzib53zUYVWZVKF2wBCYJXDyVhvhW+WlARi1vCB/9yjXg5g7/3TvGU+FUYoBWpPZwaD5Kqeo91tDzDXhwbI1tcJX4g13DPeaK4SKMf121MwZqLhdLazFmu8fVt7f4jCZ1mqogrQ4yWbgd0nb5igrWHFRQy+K3z0YDbb6ZBDTDXLziq/X19Tq+7dHDsrDXrF7g4tIuX9emvgt7J9kmSCYVGZFzi7qHe89keacFoTQ6N+kLz62yTRSw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE65lCWo/lvkIpk2NEnXuOdmruKsPOZyzgndg7y/0Kgr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINEo9V+9s5ah0lG0o84PEmbCaly9mnI1vL/BbX1BOUpK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIIbPokFUyLbgd1KTQ2x9iKRRZOZ8Yi5wP9dQnuDUifOp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHfDeBlv4pzRh9miFKFc1DNvBvzaDNpfF5LSI8n1d/fY
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQCoU+XJR0Fc2CCoqR/TKU/dtK3miO7EamTDzeio4u0Ag4egwRfiwzqwPfq9b/0YlNEhlBHk/TSIlBX3hOMlJ5X7BlipdiR1zNTrOl21AhbdUbS2wEcEe++WYJJjlgb6nLBhYIeD9ZWnCqfSBVlbmIh5jNG2UxWHR1rV7D+P/zX3nTfgBlzpE8v+g5ukxZqh3t++VKmUwFB4kRiC7jiZ5Jouz2VzflozYe/gJlbaKaxU5avzIg2dtI/bsU+80EyJj7s75nZiegSD3NkCsOFykVwYVVzuv4ZJ58i5n0F6q6zUGLgBpB7i5JadfjWHqFUpwj3lkST6w/DwUM8x37McHdlYKEwSbCaWYg5pVgKmraNjzWUqD/FQDIG/tR3O7jkanST0lNJu2aIMWf+i6n/0tQzLYPmd0OAp3njwqtSG+CkkTJMQi7f1cs9z2hpJVdvPxULYNg8J4+jkaGZ4yOzApyP0R9MGKTE8b2ACpqi+J+U33Su384yZS1G0ALh/yFvXn1M=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPAjXbfOso7sBZ/ubVmAJoFOQM/ew0ol0IgyR4SAGZjr
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDMCykDYR4SrWyMgPv9qR9SnZ7WZQKt+6X67LRcPU6BS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICKloryYpe71y7w5dTw6OuRkHNUbTw48m6TFAZu28N/G
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQClJrUszVOPDQxxcfk1bRBZ7ym+elIGdOt4fHlv5Nuv4e0FEPOaKDYFmvrq1/+BDMdOmY6KqsHu69RzypRnhr9tD/U2CDX9Pp9ngIAYFW4og/ImNHdluZyjCn8H1J5E0ahigSW2A+yPV3i6eiegFQue0S+4Q5szmM36h6BCpX9HwMqFfZ3Z3LJmyVodqNP2eMEheRp4evlGV7fS4EhugWA6sFkcznkrpvLQ7ty5G/IfgSg59wy+6HYqE7aFhDfvRYkhnYP9DBYWnZCoq6FSHsXp0+Y136OVb93URliWNeekTfnxFYzsVX08ZtXNRNSPCSoj25lf3P+9hpu5XxQEoexGaMm+ctf/YGELPsTQoHdE33ElSWTTUlstMmYaA5JqnuQ5s4m2qSgCJ6FrGkP+Rf+GSB9fxgbvsizN8K29ZtLAs7/M6gj69cEjkPiOtQHgtRAoijzP5tJxheOLrvdaiGmOuBSiiaoYJnMg7gfs7lEMrc0xxZxoF0v90K8SMbVjey8=
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDXlHSbZduL5DmEjkUI2d3UZM7qBpQ22J0hyeh3qJ9X40k/7q5qzCAFLG8wWqxe7xpc4lJOGt0+lCLWtDUEGLjFh0SasWwO8BfvcELMU6qC02K9HSA5vOLyjQHAW2pNmW2QFb9H9gu7Gf+0oWHiwgCQcbwQIs1FsnrMkaWPdVJiKD/EHN/D23zEos5guqS8EOajLi/0M/X87jGTBdhmU4W8+P162YDYOVomcNUgJ1KNXaLA8nhBZ99TLjeQokDwx0qYyIHbaEjE04NSTQmCrTEJOxq6XTW0uuy7IrqIJMUvu3Z7apOtbR67lRqZkPpjCUoGWXkskNWk9v52+GEPBuvFvl+lymS726Gm0WY3ASI7kLBFohGzaO0lPMgIkXYGPgzDCPKqN+oRSRar9T+zq/0tHJIIUBLkRcHL47wjXuUPucFnW2aMA4PUWgeo37yzpGdjfDlGXX09A1Zb1o/KjTgEc1H/kBpq5fLuwjFInk3+JE2vaj8MCoZzkzQ/f1+hhDM=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAYVlJ0jbjIexBaoiaFrLo3xe10LZZFrsXDK/YwiZTGl
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFq7cvv7/xseFKoppARto+//XN6LHD5Rhd8wyjI4Bo1j
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAINr/48dOiWS4MclfUjNAOU1ElvE+RdXhl/mSNMVDj/VX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEm2Lz1lH7CkKMc8UueTN/EXRJ049snn0aML3DC77Q3
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJfCs3GrPN4/mhDWsYARVdQDqldk7e+bFa1J/eG5CSfa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJbv3trtNrG/8AELI7mIXsc/67TNkhotdybRaJhsmUX2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIH0Ltxqm3CYKWKfUH8jKRtKcHrDKOQMxdYyNI8Lru9+R
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIE1Yy8vr9x403zToU0yCnPdQxHqPdCWZZ3WixcL4s3Ra
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoeiR/1St1o2sQzR2sBVROutq9NExTRbvtNJ+4Qdns2
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFUvtCbJmsEPC3M+BqX1d/lzg/+lQCSFUukH1DGr3Pte
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIJU5smqCeynIb6hwW7+oJJxrwzsqg80Jy458cPfPClf7
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKivpSOuxiIX1Et7jSOZAnDVTO0YtIiUnS/uabTHcWy4
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHX6zNaNZGARb/y/p7xLhrEhL+kBT3NMwwJaq1g7/GuD
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICsEVwOukV3Bc0BbWvo6599VB+pyk3JzaSIF+5NhlItp
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIATpKGT2C4KRW5lzvzZdA0Z5YnCxfkuo206vZC23sdKx
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIO4sRX1GaGRNpAVKnjQ/civFgQAnrnUkvHyjokyUDE0b
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDNBcmQT98GV+cPm91o7Js5zaLF7WK5t6tYIn4sRs0yA65VSAx6LCf58PO70uIDZgfdRjVpJIXwyrT+Jp0WymKpN6eoolTV4iPS4jVrvgEh9IWMjyeaD96zJGJb48+9SfL+cwD0FzzJl/AOpRdwLsd1+Dp9etwc9A7xfbNv4H87zPG9B70/iyfvZsTBMv8a98bcwuwSJCTgUM8gpcurNiYQ22ZUmOMdbd6KDLDfKPgtZYvj3Sd77tGgoDGBVphEGNGUdeQg8D4bT5BDQP6H27fTgcQQmvl7h1u8+rYctdQ/1yMie0Gphr11v4Sk/TdK4koPizt12Ud2c9afcNWAqpAxZYPfSkxK42OvSf7h2ML0H0mqlHuBDSl03ssj5S+XV6YEcc3ROa8tIMW164J3L00FLrh1FHYMVEUhhyXfEop1zxVsWqyLZbghywFoY7xgqjwKO3Rp/Ar/+fZVzgigPV9Urvp/+QQLyREDc0UXJsvbp6s+TMHsTerYm2Snvb93EdRJX4XtQkcUmiDpBxVu740nhWv1mBoTZDTLSTJ+M9qE2lEB0x1zrJO89pyeoYcjycLKF99fFRfG4xB4fnf5OWib09YHrUnN43N20pDwN6krFSDXc+l67tnR9B6ECoQq7+heMwBQI8lT5hWK8JlRNrwRMeGsu4Bn8+xrwCeZxU8lEw==
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAICEVEwXtaBH4iqUOhzjga1OpR6tbz0isDz2XpUWfYCUa
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIF5hZflnROmzsW5qWufFKM6H4co4yAXBnCNC3f3q8c6N
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC0XJor2MIHHovz9GGM8EyFECwWjkX7KfsV8itHdHdxE
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHJuzI5rpqTkS9/Q1XlsI+ul8I0YblRoj0F52fiqS1pK
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIC7GbyDF740MYnPUBJyjqhDU0y5bp9t6Z/r/e2Bqzxpe
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIA7kcBxlv6ra+yaItmzFpR06BHa6s/TZVjmZj1NB/v9P
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIAS3/JggZ4rUMCbanlf1L94ktbn8SsnTJ9VeMvdavwPR
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIEVhKLZ8i/A+uwyZacrTTB4tliWZmMAHYwNMBEVeOf3d
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBJpwlU91GQVOoqUfIXNW/AWf0HDUJrYthmN+q1ImbJ6mmqBRfjxzrUAlBg5Rno+ukZzER47oZU8i/FphhFOW77w=
                    ecdsa-sha2-nistp256 AAAAE2VjZHNhLXNoYTItbmlzdHAyNTYAAAAIbmlzdHAyNTYAAABBBPeMymt3+7BANs8xF+pKxGmsNylOGob1TOegTt9EzjBuS8F1fvM0HzKvKybchuxfKjZS+1V6Re4xslcxfmGS1/8=
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIDQji7qyjer7ukWQpOG9GIxOnOoAbMGuo9dLblhgPm5F
                    ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABAQC1SbtZX9JodwxhazqRkBOTzN2AtyeFlgOnO+bXY+Rm/eabX/s9oqcOITZabnFbn0EmPOXuMCzyDRdTJqA1fJr8eGi4bDZTTjwji9UgxrwPeJURgKus3u1O2P9rT0fpRMt82E9rrkbQWjQee6c0KII0QQO5mmblKSfl8UP7QqzIaUpCfFx/tjty7at+qrPuYo5ulI8eQ6RNXYzTLVgAtdFWZWz3sNLSkHAGyciOs3vzqvXlskGfCl6XRwZYiPG/nv9fRRdOaIIR/ghWHbjOsnkqx8STKmDCDTdQN1bSc0IPZPdoMRRHDHYNhrAIvVpLWoha/crICLwELhiLxe5d4BdX
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFKZKKclDlMGWI4aDzyR/6qM1L+Q4s4NHuP8k+3CuBpP
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHnWrML/9p+a6oj73dEOXlT7gdeEAX2EFBGVU2we+3SS
                    ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPzi/4rbhzmmRTy3Dn8Y4b3UL3a4szH9cqh4zeG34N+r
                EOT,
            ]
        }

      + network_interface {
          + mac_address     = (known after apply)
          + upstream        = "113800519377"
          + user_ip_address = "192.168.100.106"
        }

      + timeouts {
          + create = "1h"
          + delete = "1h"
        }
    }

  # sakuracloud_vpc_router.k8s_internal_router will be created
  + resource "sakuracloud_vpc_router" "k8s_internal_router" {
      + id                  = (known after apply)
      + internet_connection = true
      + name                = "drove-dev-internal-router"
      + plan                = "standard"
      + public_ip           = (known after apply)
      + public_netmask      = (known after apply)
      + tags                = [
          + "dev",
          + "drove",
        ]
      + version             = 2
      + zone                = (known after apply)

      + private_network_interface {
          + index        = 1
          + ip_addresses = [
              + "192.168.100.254",
            ]
          + netmask      = 24
          + switch_id    = "113800519377"
        }

      + scheduled_maintenance (known after apply)

      + site_to_site_vpn_parameter (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cluster_pass                 = (sensitive value)
  + ipv6_prefix                  = "2001:e42:407:1041::"
  + ipv6_prefix_len              = 64
  + k8s_control_plane_ip_address = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + k8s_dns_nameservers          = (known after apply)
  + k8s_dns_zone                 = "drove-dev.ictsc.net"
  + k8s_worker_node_ip_address   = [
      + "192.168.100.101",
      + (known after apply),
      + "192.168.100.103",
      + (known after apply),
      + "192.168.100.105",
      + (known after apply),
    ]
  + max_ip_address               = "163.43.146.142"
  + min_ip_address               = "163.43.146.136"
  + vip_address                  = "163.43.146.135"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>